{
    "blogs": [
        {
            "name": "Jannat ke Pattey by Nimrah Ahmed: A Review",
            "author": "Anam Fatima",
            "date": "21 Sep, 2024",
            "preview": "Reading is therapeutic, everyone knows, but reading an Urdu novel of around 798 pages is truly something!..."
        },
        {
            "name": "Existential Diaries: A Book Review",
            "author": "Anam Fatima",
            "date": "19 Feb, 2021",
            "preview": "‘Existential Diaries’ offers a plethora of thoughtful poems covering the social, emotional and philosophical domains. It’s not just ‘a journey through sanity and insanity’ but has a lot more to offer to the reader..."
        },
        {
            "name": "Dewa Mela 2018: Strolling down memory lane",
            "author": "Anam Fatima",
            "date": "6 July, 2020",
            "preview": "It was a sheer delight to be present at home this Dewa Mela 2018 and enjoy the intricacies of the entire fair vividly..."
        },
        {
            "name": "Struggles Unveiled: On Getting Published",
            "author": "Anam Fatima",
            "date": "15 August, 2018",
            "preview": "It's laudable to set up goals and aspire towards them. This is the only way to make life happening and directional. But we are governed by laws, be it physics, chemistry, history or civics..."
        },
        {
            "name": "हर पल बदलती ज़िंदगी",
            "author": "Anam Fatima",
            "date": "20 May, 2018",
            "preview": "आख़िरकार इम्तेहान ख़त्म हो ही गए| बाक़ी रह गया तो फ़िर वही सन्नाटा जो दो साल पहले था| मगर इस बात की ख़ुशी है या ग़म कहना मुश्क़िल है| इम्तेहान शुरू होने से कुछ ही दिन पहले की बात है| कॉलेज फेरवेल के दो दिन हुए थे| काफ़ी ख़ुशी थी| अच्छे अच्छे पल तस्वीरों मे क़ैद हुए थे|..."
        },
        {
            "name": "Writers on Writing",
            "author": "Anam Fatima",
            "date": "11 March, 2018",
            "preview": "'We write to taste life twice, in the moment and in retrospect'..."
        },
        {
            "name": "Under the Radiant Sky",
            "author": "Anam Fatima",
            "date": "7 November, 2017",
            "preview": "The sky was luminescent and the water radiant. The trees lined the lake and seemed to reach the skies. The sight was a pure balm to my soul. May be I was on a boat. The movement was silky and wavy..."
        },
        {
            "name": "An Exclusive Self-talk with Anam Fatima, Author of Nascent Poetry",
            "author": "Anam Fatima",
            "date": "6 August, 2017",
            "preview": "Writing a book and getting it published is not an everyday occurrence. It's perseverance at the face of crumbling hopes, believing in dawn while surrounded with darkness, tasting the sweetest and the sourest..."
        },
        {
            "name": "Anam's Nascent Poetry: A Book Review",
            "author": "Areeba Ali",
            "date": "13 July, 2017",
            "preview": "Poems are succinctly written vividly capturing the everyday life of common populace. One can easily relate to them. They give a sheen of calmness and an agreeable feeling with your words..."
        },
        {
            "name": "Book Review: The Struggle Between My Heart & My Brain by Mehr Bani",
            "author": "Anam Fatima",
            "date": "30 April, 2017",
            "preview": "'Rationality  doesn't work with the organ named heart, but faith does and the blinder your faith is, the stronger the conviction you can draw out of it.'..."
        },
        {
            "name": "Discovering the Poetic Horizons: In Conversation with Yaseen Anwer",
            "author": "Anam Fatima",
            "date": "24 March, 2017",
            "preview": "Yaseen Anwer, a young gentleman and poet is a well known personality in Delhi. He is the Founder of Kaafiya, a rapidly growing community of poetry lovers, bringing up the fresh flavor of poems written by both the old, well known poets as well as the present, contemporary ones..."
        },
        {
            "name": "Let's Walk Along the Memory Lane (Part 1)",
            "author": "Anam Fatima",
            "date": "4 March, 2017",
            "preview": "Some people write poems, some live poetically. I am but a string of simple pendulum constantly caught between the two extremes. Are you too? Let's tread together then, holding each other's hands, over the mud paved roads of childhood..."
        },
        {
            "name": "Just Another Day",
            "author": "Anam Fatima",
            "date": "12 July, 2016",
            "preview": "Today isn't yesterday or tomorrow but a day as free as a spider's web, with wondrous mysteries and creativity to work on. I've been given not just life but the responsibility to give something 'to day' by living it with gratitude..."
        },
        {
            "name": "Snow Love",
            "author": "Anam Fatima",
            "date": "28 June, 2016",
            "preview": "Rehan was a six year-old child with great dreams, rare in the kids of his age. His father was a poor rickshaw-puller, but rich in honesty and virtue. His mother died early, leaving all responsibilities on his father’s shoulders..."
        },
        {
            "name": "A Younger Sister’s Story",
            "author": "Anam Fatima",
            "date": "28 June, 2016",
            "preview": "Sara was gazing at the toffee boxes in a shop like a butterfly gazing at a flower. Scratching her head she wondered which one to choose. A two rupee note was a pretty good amount for a little child like her to be satisfied..."
        },
        {
            "name": "Rohan and a Squirrel",
            "author": "Anam Fatima",
            "date": "28 June, 2016",
            "preview": "Friendship is something that erases boundaries and creates a special bonding. Rohan was a young boy who was quick in making friends. Everyone liked him. The neighbors always chatted about his gentle manners that were scarce in their own children..."
        },
        {
            "name": "A Broken Toy",
            "author": "Anam Fatima",
            "date": "28 June, 2016",
            "preview": "Brokenness is the Essence of Existence; it’s the Force of Life that Crafts Jewels..."
        },
        {
            "name": "Book Review: The Shadow of the Dark Soul by Sukhmani Gandhi",
            "author": "Anam Fatima",
            "date": "3 Jan, 2016",
            "preview": "Sukhmani Gandhi's The Shadow of the Dark Soul is an effective piece honestly showcasing the time we live in. It’s a bold initiative to bring a change in societal perception towards women as well as men..."
        },
        {
            "name": "Channelizing Anger into Creativity",
            "author": "Anam Fatima",
            "date": "3 Jan, 2016",
            "preview": "We all belong to the amazing human race and are prone to anger just as much as hunger, love, emotions, etc. The only thing that makes a difference is how we take it: whether we make it or break it..."
        },
        {
            "name": "Photocapturasis Syndrome",
            "author": "Anam Fatima",
            "date": "3 Jan, 2016",
            "preview": "Photocapturasis Syndrome is a serious disorder spreading its wings and conquering the minds. The patients are concerned boundlessly with clicking photographs and even forget to enjoy that particular moment..."
        },
        {
            "name": "Are You Free",
            "author": "Anam Fatima",
            "date": "3 Jan, 2016",
            "preview": "Freedom? Let’s explore it. Does it allow you to kill your neighbor or rape anyone? No, your freedom ought not to hurt other’s sentiments. Freedom is discipline. It comes through equality and is comprised of morality..."
        },
        {
            "name": "Why Literature",
            "author": "Anam Fatima",
            "date": "3 Jan, 2016",
            "preview": "It was a simple day, same sun, same roads, same traffic and same fear of getting late for the first lecture. The only unique event was a guest lecture by Ashok Vajpeyi..."
        }
    ]
}
